**CLEANING DATA USING DROPNA()**
* **df.drop_duplicates:** Drop all identical data entry
* **df.fillna:** Drop all N/A values and replace it with another data

In [1]:
#Loading libraries
import pandas as pd
import matplotlib.pyplot as plt
from datasets import load_dataset

#Loading data
dataset = load_dataset('lukebarousse/data_jobs')
df = dataset['train'].to_pandas()
df

#Clean data
df.job_posted_date = pd.to_datetime(df.job_posted_date)

In [2]:
#Replace N/A by another values u
df_filled = df
salary_hour_median = df.salary_hour_avg.median()
salary_year_median = df.salary_year_avg.median()

df_filled['salary_hour_avg'] = df_filled['salary_hour_avg'].fillna(salary_hour_median)
df_filled['salary_year_avg'] = df_filled['salary_year_avg'].fillna(salary_year_median)
df_filled.loc[:5,'salary_year_avg':'salary_hour_avg']

   salary_year_avg  salary_hour_avg
0         115000.0            45.98
1         115000.0            45.98
2         115000.0            45.98
3         115000.0            45.98
4         115000.0            45.98
5         115000.0            45.98

In [4]:
#Remove duplicate values 
df_unique = df_filled
df_unique = df_unique.drop_duplicates()
print(f'The original length: {len(df_filled)}')
print(f'The unique length: {len(df_unique)}')
print(f'Ommited values: {len(df_filled) -len(df_unique) }')
df.head(2)

The original length: 785741
The unique length: 785640
Ommited values: 101

,job_title_short,job_title,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg,company_name,job_skills,job_type_skills
0,Senior Data Engineer,Senior Clinical Data Engineer / Principal Clin...,"Watertown, CT",via Work Nearby,Full-time,False,"Texas, United States",2023-06-16 13:44:15,False,False,United States,None,115000.0,45.98,Boehringer Ingelheim,None,None
1,Data Analyst,Data Analyst,"Guadalajara, Jalisco, Mexico",via BeBee México,Full-time,False,Mexico,2023-01-14 13:18:07,False,False,Mexico,None,115000.0,45.98,Hewlett Packard Enterprise,"['r', 'python', 'sql', 'nosql', 'power bi', 't...","{'analyst_tools': ['power bi', 'tableau'], 'pr..."

In [5]:
#Remove values with multiple filters
df_unique = df_unique.drop_duplicates(subset=['job_title','company_name'])
print(f'The original length: {len(df_filled)}')
print(f'The unique length: {len(df_unique)}')
print(f'Ommited values: {len(df_filled) -len(df_unique) }')

The original length: 785741
The unique length: 508042
Ommited values: 277699